app/controllers/password_resets_controller.rb

  def get_user
    @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "thenicholashernandez@gmail.com"], ["LIMIT", 1]]